---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ProductMaterialDescription
source: html/956f1a31-50a6-33f8-a135-86d8c6e7f6b2.htm
---
# Autodesk.Revit.DB.FabricationPart.ProductMaterialDescription Property

The product material description of the fabrication part.

## Syntax (C#)
```csharp
public string ProductMaterialDescription { get; }
```